# ~/.config/Brewfile
# Base Homebrew bundle for shared macOS CLI/dev tooling.

tap "amar1729/formulae"
tap "dopplerhq/cli"
tap "getsentry/tools"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "mongodb/brew"
tap "terrastruct/tap"
tap "tinygo-org/tools"
tap "wedow/tools"

brew "ast-grep"
brew "btop"
brew "coreutils"
brew "direnv"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazygit"
brew "lazysql"
brew "mosh"
brew "mtr"
brew "rename"
brew "ripgrep"
brew "sshpass"
brew "tmux"
brew "tree"
brew "unar"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "cmake"
brew "gcc"
brew "luajit"
brew "qt@5"

brew "aom"
brew "ffmpeg"
brew "imagemagick"
brew "poppler"
brew "resvg"
brew "sevenzip"
brew "tesseract"
brew "ttyd"

brew "awscli"
brew "cocoapods"
brew "go"
brew "golang-migrate"
brew "golangci-lint"
brew "heroku"
brew "mise"
brew "pnpm"
brew "swift-format"
brew "tinygo-org/tools/tinygo"

brew "docker"
brew "lima"
brew "qemu"

brew "d2"
brew "gnuplot"
brew "terrastruct/tap/tala"
brew "vhs"

brew "amar1729/formulae/browserpass"
brew "dopplerhq/cli/doppler"
brew "mkcert"
brew "pass"
brew "pass-import"
brew "pinentry-mac"
brew "ykman"
brew "wedow/tools/ticket"

brew "wireguard-go"
brew "jesseduffield/lazydocker/lazydocker"
brew "getsentry/tools/sentry"
